{
	"Trp": {
		"combinations": ["UGG"],
		"fullname": "Tryptophan",
		"info": "Tryptophan is found mainly in animal or plant-based protein sources such as chicken, eggs, cheese, fish etc. It was discovered in 1901 after it was isolated from milk. It affects mood, cognition and behavior."
	},
	"Phe": {
		"combinations": ["UUU", "UUC"],
		"fullname": "Phenylalanine",
		"info": "It exists in two forms — L-phenylalanine and D-phenylalanine. Found in high protein foods like eggs, dairy, meat, and soy products. It benefits skin conditions, depression, and improving memory."
	},
	"Leu": {
		"combinations": ["UUA", "UUG", "CUU", "CUC", "CUA", "CUG"],
		"fullname": "Leucine",
		"info": "Necessary for building and repairing muscles, also tt helps to regulate blood sugar, improves wound healing, and produces growth hormone. Found in brown rice, nuts and beef."
	},
	"Ser": {
		"combinations": ["UCU", "UCC", "UCA", "UCG", "AGU", "AGC"],
		"fullname": "Serine",
		"info": "Serine comes in two forms: L-serine and D-serine. Used to improve sleeping, schizophrenia, Parkinson disease, and memory and thinking skills. Found in foods such as lamb, liver, pork, salmon, sardines, seaweed and tofu. Was discovered in 1865."
	},
	"Tyr": {
		"combinations": ["UAU", "UAC"],
		"fullname": "Tyrosine",
		"info": "Tyrosine is a nonessential amino acid the body makes from another amino acid called phenylalanine. It influences mood and helps produce melanin that responsible for hair and skin color. Tyrosine is found in soy products, turkey, fish, peanuts, almonds, avocados, bananas and sesame seeds."
	},
	"Cys": {
		"combinations": ["UGU", "UGC"],
		"fullname": "Cysteine",
		"info": "The body makes cysteine from methionine, an essential amino acid. It is found in Ricotta Cottage cheese, granola, oat flakes and yogurt. It plays a role in the normal growth rate of hair, may also help reduce aging of the skin."
	},
	"Pro": {
		"combinations": ["CCU", "CCC", "CCA", "CCG"],
		"fullname": "Proline",
		"info": "The body uses proline to make proteins, such as collagen. Collagen is found in the skin, bones, and joints. Proline is also involved in the general function of cells. Most meats, fish, and dairy foods contain proline."
	},
	"His": {
		"combinations": ["CAU", "CAC"],
		"fullname": "Histidine",
		"info": "Was first isolated in 1869. Producing red blood cells and maintaining normal hemoglobin levels. Hemoglobin is a protein that delivers oxygen from the lungs to the rest of the body. Found in potatoes, corn, fish and seafoods."
	},
	"Gln": {
		"combinations": ["CAA", "CAG"],
		"fullname": "Glutamine",
		"info": "Glutamine is the most abundant amino acid in the body. It helps transporting substances in the blood and fighting off harmful viruses and bacteria. Glutamine is found in skim milk, corn, white rice and tofu."
	},
	"Arg": {
		"combinations": ["CGU", "CGC", "CGA", "CGG", "AGA", "AGG"],
		"fullname": "Arginine",
		"info": "Arginine plays an important role in cell division, wound healing, removing ammonia from the body, immune function, and the release of hormones. Found in meat, fish, nuts and seeds."
	},
	"Ile": {
		"combinations": ["AUU", "AUC", "AUA"],
		"fullname": "Isoleucine",
		"info": "Was first discovered in 1903. Found in dairy, soy, beans, and legumes. Isoleucine can improve the immune system, including immune organs, cells and reactive substance."
	},
	"Met": {
		"combinations": ["AUG"],
		"fullname": "Methionine",
		"info": "Methionine starts the production of proteins in your body. High levels of methionine can be found in eggs, meat, and fish; sesame seeds, Brazil nuts, and some other plant seeds; and cereal grains. Most fruits and vegetables contain very little. It is also used as a start codon."
	},
	"Thr": {
		"combinations": ["ACU", "ACC", "ACA", "ACG"],
		"fullname": "Threonine",
		"info": "Threonine participates in many reactions in bacteria, including the biosynthesis of vitamin B12. It makes up the protein in teeth, enamel, collagen, and elastin."
	},
	"Asn": {
		"combinations": ["AAU", "AAC"],
		"fullname": "Asparagine",
		"info": "Asparagine was first purified from asparagus juice in 1806; proof of the occurrence of this amino acid in proteins was finally obtained in 1932. Asparagine is not essential for humans, which means that it can be produces in our body and is not required in the diet."
	},
	"Lys": {
		"combinations": ["AAA", "AAG"],
		"fullname": "Lysine",
		"info": "Lysine appears to help the body absorb calcium, and it plays an important role in the formation of collagen, a substance important for bones and connective tissues including skin, tendons, and cartilage. It helps to convert fats stored in our body into energy."
	},
	"Val": {
		"combinations": ["GUU", "GUC", "GUA", "GUG"],
		"fullname": "Valine",
		"info": "In 1901, German chemist Emil Fischer was the first person to isolate valine from casein, a protein found in dairy products as well as breast milk. Good sources of Valine include cottage cheese, poultry, fish, peanuts, and lentils."
	},
	"Ala": {
		"combinations": ["GCU", "GCC", "GCA", "GCG"],
		"fullname": "Alanine",
		"info": "It is a source of energy for muscles and the central nervous system. was first synthesized in 1850. Found in milk and dairy products, eggs, meat and fish."
	},
	"Asp": {
		"combinations": ["GAU", "GAC"],
		"fullname": "Aspartate",
		"info": "helps to break down toxic substances within cells and is needed for making a certain molecule that delivers signals in the brain. First isolated in 1806. Found in whole grains, seeds, soy products, seafoods and fish."
	},
	"Glu": {
		"combinations": ["GAA", "GAG"],
		"fullname": "Glutamate",
		"info": "First isolated in 1866. It's needed to keep the brain functioning properly. Glutamate plays a major role in shaping learning and memory. It helps nerve cells in the brain send and receive information from other cells. It may be involved in learning and memory. Found in cheese, milk, mushrooms, meat, fish, and many vegetables."
	},
	"Gly": {
		"combinations": ["GGU", "GGC", "GGA", "GGG"],
		"fullname": "Glycine",
		"info": "First discovered in 1820. It contributes to cellular growth and health. Found in gelatin powder, bone broth, meet and seafood."
	},
	"Stop": {
		"combinations": ["UAA", "UAG", "UGA"],
		"fullname": "Stop codon",
		"info": ""
	}
}
